{
  "One Flew Over the Cuckoo's Nest": {
    "title": "One Flew Over the Cuckoo's Nest",
    "genre": "Drama",
    "year": "1975",
    "plot": "A rebellious convict is sent to a psychiatric hospital for evaluation in 1963 Oregon, and encourages his docile companions to take more control of their lives and defy the tyrannical head nurse.",
    "imdb": "8.7"
  },
  "Stare Grzechy Daja Dlugie Cienie": {
    "title": "Stare Grzechy Daja Dlugie Cienie",
    "genre": "Unknown"
  },
  "The Butterfly Effect": {
    "title": "The Butterfly Effect",
    "genre": "Drama, Sci-Fi, Thriller",
    "year": "2004",
    "plot": "Evan Treborn suffers blackouts during significant events of his life. As he grows up, he finds a way to remember these lost memories and a supernatural way to alter his life by reading his journal.",
    "imdb": "7.6"
  },
  "Serial - 'What Did We Do to Deserve This?'": {
    "title": "Serial - 'What Did We Do to Deserve This?'",
    "genre": "Unknown"
  },
  "Green Book": {
    "title": "Green Book",
    "genre": "Biography, Comedy, Drama",
    "year": "2018",
    "plot": "A working-class Italian-American bouncer becomes the driver for an African-American classical pianist on a tour of venues through the 1960s American South.",
    "imdb": "8.2"
  },
  "Don't Mess With the Hairdresser": {
    "title": "Don't Mess With the Hairdresser",
    "genre": "Unknown"
  },
  "Nigdy W Zyciu": {
    "title": "Nigdy W Zyciu",
    "genre": "Comedy, Drama, Romance",
    "year": "2003",
    "plot": "Judyta is a middle-aged housewife whose peaceful life suddenly falls apart due to divorce. But soon she finds the strength to carry on fighting for her happiness, a place in the sun and love of her life.",
    "imdb": "5.6"
  },
  "2001: Odyseja Kosmiczna": {
    "title": "2001: Odyseja Kosmiczna",
    "genre": "Unknown"
  },
  "Mikrokosmos": {
    "title": "Mikrokosmos",
    "genre": "Short, Drama, Horror",
    "year": "2013",
    "plot": "A short about subjectivity of problems of all nature. Shot on Canon 550D and anamorphic lenses.",
    "imdb": "N/A"
  },
  "Pretty woman": {
    "title": "Pretty woman",
    "genre": "Comedy, Romance",
    "year": "1990",
    "plot": "A corporate raider hires a hooker to act as a business escort in Beverly Hills, California.",
    "imdb": "7.1"
  },
  "Passengers": {
    "title": "Passengers",
    "genre": "Drama, Romance, Sci-Fi",
    "year": "2016",
    "plot": "A malfunction in a sleeping pod on a spacecraft traveling to a distant colony planet wakes one passenger 90 years early.",
    "imdb": "7.0"
  },
  "Killer Wedding": {
    "title": "Killer Wedding",
    "genre": "Unknown"
  },
  "The Departed": {
    "title": "The Departed",
    "genre": "Crime, Drama, Thriller",
    "year": "2006",
    "plot": "An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.",
    "imdb": "8.5"
  },
  "Parasite": {
    "title": "Parasite",
    "genre": "Drama, Thriller",
    "year": "2019",
    "plot": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
    "imdb": "8.5"
  },
  "Gladiator": {
    "title": "Gladiator",
    "genre": "Action, Adventure, Drama",
    "year": "2000",
    "plot": "A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.",
    "imdb": "8.5"
  },
  "Auta 2": {
    "title": "Auta 2",
    "genre": "Unknown"
  },
  "The Fast and the Furious: Tokyo Drift": {
    "title": "The Fast and the Furious: Tokyo Drift",
    "genre": "Action, Crime, Thriller",
    "year": "2006",
    "plot": "A teenager becomes a major competitor in the world of drift racing after moving in with his father in Tokyo to avoid a jail sentence in America.",
    "imdb": "6.1"
  },
  "Hot Shots!": {
    "title": "Hot Shots!",
    "genre": "Action, Comedy",
    "year": "1991",
    "plot": "A parody of Top Gun (1986) in which a talented but unstable fighter pilot must overcome the ghosts of his father and save a mission sabotaged by greedy weapons manufacturers.",
    "imdb": "6.7"
  },
  "Taxi (1998)": {
    "title": "Taxi (1998)",
    "genre": "Unknown"
  },
  "Kill bill 2": {
    "title": "Kill bill 2",
    "genre": "Unknown"
  },
  "Taxi Driver": {
    "title": "Taxi Driver",
    "genre": "Crime, Drama",
    "year": "1976",
    "plot": "A mentally unstable veteran works as a nighttime taxi driver in New York City, where the perceived decadence and sleaze fuels his urge for violent action.",
    "imdb": "8.2"
  },
  "The Silence of the Lambs": {
    "title": "The Silence of the Lambs",
    "genre": "Crime, Drama, Horror",
    "year": "1991",
    "plot": "A young F.B.I. cadet must receive the help of an incarcerated and manipulative cannibal killer to help catch another serial killer, a madman who skins his victims.",
    "imdb": "8.6"
  },
  "Suits": {
    "title": "Suits",
    "genre": "Comedy, Drama",
    "year": "2011–2019",
    "plot": "On the run from a drug deal gone bad, brilliant college dropout Mike Ross finds himself working with Harvey Specter, one of New York City's best lawyers.",
    "imdb": "8.4"
  },
  "Barbie": {
    "title": "Barbie",
    "genre": "Adventure, Comedy, Fantasy",
    "year": "2023",
    "plot": "Barbie and Ken are having the time of their lives in the seemingly perfect world of Barbie Land. However, when they get a chance to go to the outside world, they soon discover the joys and perils of living among regular humans.",
    "imdb": "6.8"
  },
  "Doctor Strange": {
    "title": "Doctor Strange",
    "genre": "Action, Adventure, Fantasy",
    "year": "2016",
    "plot": "While on a journey of physical and spiritual healing, a brilliant neurosurgeon is drawn into the world of the mystic arts.",
    "imdb": "7.5"
  },
  "Kingsman: The Secret Service": {
    "title": "Kingsman: The Secret Service",
    "genre": "Action, Adventure, Comedy",
    "year": "2014",
    "plot": "A spy organisation recruits a promising street kid into the agency's training program, while a global threat emerges from a twisted tech genius.",
    "imdb": "7.7"
  },
  "Amelia": {
    "title": "Amelia",
    "genre": "Adventure, Biography, Drama",
    "year": "2009",
    "plot": "A look at the life of legendary American pilot Amelia Earhart, who disappeared while flying over the Pacific Ocean in 1937 in an attempt to make a flight around the world.",
    "imdb": "5.8"
  },
  "Don't Look Up": {
    "title": "Don't Look Up",
    "genre": "Comedy, Drama, Sci-Fi",
    "year": "2021",
    "plot": "Two low-level astronomers must go on a giant media tour to warn humankind of an approaching comet that will destroy planet Earth.",
    "imdb": "7.2"
  },
  "Lucifer": {
    "title": "Lucifer",
    "genre": "Crime, Drama, Fantasy",
    "year": "2016–2021",
    "plot": "Lucifer Morningstar has decided he's had enough of being the dutiful servant in Hell and decides to spend some time on Earth to better understand humanity. He settles in Los Angeles - the City of Angels.",
    "imdb": "8.0"
  },
  "The Father": {
    "title": "The Father",
    "genre": "Drama, Mystery",
    "year": "2020",
    "plot": "A man refuses all assistance from his daughter as he ages. When he tries to understand what is happening around him, he begins to doubt his loved ones, his own mind and even the fabric of his reality.",
    "imdb": "8.2"
  },
  "Trup": {
    "title": "Trup",
    "genre": "Animation, Short",
    "year": "2023",
    "plot": "When the end of life comes, you have to leave the world and go, this standard procedure in the case of the titular corpse must be postponed. Due to a heavenly mistake, he is forced to stay one more day on earth. However, to fill t...",
    "imdb": "N/A"
  },
  "The Lord of the Rings": {
    "title": "The Lord of the Rings",
    "genre": "Animation, Adventure, Fantasy",
    "year": "1978",
    "plot": "The Fellowship of the Ring embark on a journey to destroy the One Ring and end Sauron's reign over Middle-earth.",
    "imdb": "6.2"
  },
  "The Room": {
    "title": "The Room",
    "genre": "Drama",
    "year": "2003",
    "plot": "In San Francisco, an amiable banker's seemingly perfect life is turned upside down when his deceitful bride-to-be embarks on a passionate affair with his best friend.",
    "imdb": "3.6"
  },
  "The Fan": {
    "title": "The Fan",
    "genre": "Action, Drama, Sport",
    "year": "1996",
    "plot": "An all-star baseball player becomes the unhealthy focus of an obsessive salesman.",
    "imdb": "5.9"
  },
  "Between Heaven and Hell": {
    "title": "Between Heaven and Hell",
    "genre": "Drama, War",
    "year": "1956",
    "plot": "The spoiled rich son of a wealthy Southerner is changed by his experiences in the Pacific during World War II.",
    "imdb": "6.6"
  },
  "Predator": {
    "title": "Predator",
    "genre": "Action, Adventure, Horror",
    "year": "1987",
    "plot": "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior.",
    "imdb": "7.8"
  },
  "1670 Season 2": {
    "title": "1670 Season 2",
    "genre": "Unknown"
  },
  "Jak Stracic Chlopaka W 10 Ni": {
    "title": "Jak Stracic Chlopaka W 10 Ni",
    "genre": "Unknown"
  },
  "Uprowadzona 3": {
    "title": "Uprowadzona 3",
    "genre": "Unknown"
  },
  "Her": {
    "title": "Her",
    "genre": "Drama, Romance, Sci-Fi",
    "year": "2013",
    "plot": "In the near future, a lonely writer develops an unlikely relationship with an operating system designed to meet his every need.",
    "imdb": "8.0"
  },
  "Ghost in the Shell": {
    "title": "Ghost in the Shell",
    "genre": "Action, Crime, Drama",
    "year": "2017",
    "plot": "In the near future, Major Mira Killian is the first of her kind: A human saved from a terrible crash, who is cyber-enhanced to be a perfect soldier devoted to stopping the world's most dangerous criminals.",
    "imdb": "6.3"
  },
  "Cop Dog? (unknown)": {
    "title": "Cop Dog? (unknown)",
    "genre": "Unknown"
  },
  "Lamborghini: The Man Who Created a Legend": {
    "title": "Lamborghini: The Man Who Created a Legend",
    "genre": "Unknown"
  },
  "Inception": {
    "title": "Inception",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2010",
    "plot": "A thief who steals corporate secrets through the use of dream-sharing technology is given the inverse task of planting an idea into the mind of a C.E.O., but his tragic past may doom the project and his team to disaster.",
    "imdb": "8.8"
  },
  "The Invisible Guest": {
    "title": "The Invisible Guest",
    "genre": "Crime, Drama, Mystery",
    "year": "2016",
    "plot": "A young businessman wakes up in a hotel room locked from the inside with the dead body of his lover next to him. He hires a prestigious lawyer, and over one night they work together to clarify what happened in a frenetic race agai...",
    "imdb": "8.0"
  },
  "John Wick": {
    "title": "John Wick",
    "genre": "Action, Crime, Thriller",
    "year": "2014",
    "plot": "John Wick is a former hitman grieving the loss of his true love. When his home is broken into, robbed, and his dog killed, he is forced to return to action to exact revenge.",
    "imdb": "7.5"
  },
  "Vikings": {
    "title": "Vikings",
    "genre": "Action, Adventure, Drama",
    "year": "2013–2020",
    "plot": "Vikings transports us to the brutal and mysterious world of Ragnar Lothbrok, a Viking warrior and farmer who yearns to explore--and raid--the distant shores across the ocean.",
    "imdb": "8.5"
  },
  "Heweliusz": {
    "title": "Heweliusz",
    "genre": "Drama, History",
    "year": "2025–",
    "plot": "In 1993, the Polish ferry MS Jan Heweliusz capsizes off the coast of Rügen in the Baltic Sea.",
    "imdb": "N/A"
  },
  "Captain Phillips": {
    "title": "Captain Phillips",
    "genre": "Action, Biography, Crime",
    "year": "2013",
    "plot": "The true story of Captain Richard Phillips and the 2009 hijacking by Somali pirates of the U.S.-flagged MV Maersk Alabama, the first American cargo ship to be hijacked in two hundred years.",
    "imdb": "7.8"
  },
  "Joker": {
    "title": "Joker",
    "genre": "Crime, Drama, Thriller",
    "year": "2019",
    "plot": "Arthur Fleck, a party clown and a failed stand-up comedian, leads an impoverished life with his ailing mother. However, when society shuns him and brands him as a freak, he decides to embrace the life of chaos in Gotham City.",
    "imdb": "8.3"
  },
  "The Martian": {
    "title": "The Martian",
    "genre": "Adventure, Drama, Sci-Fi",
    "year": "2015",
    "plot": "An astronaut becomes stranded on Mars after his team assumes him dead, and must rely on his ingenuity to find a way to signal to Earth that he is alive and can survive until a potential rescue.",
    "imdb": "8.0"
  },
  "Twilight": {
    "title": "Twilight",
    "genre": "Drama, Fantasy, Romance",
    "year": "2008",
    "plot": "When Bella Swan moves to a small town in the Pacific Northwest, she falls in love with Edward Cullen, a mysterious classmate who reveals himself to be a 108-year-old vampire.",
    "imdb": "5.3"
  },
  "The Terminal": {
    "title": "The Terminal",
    "genre": "Comedy, Drama, Romance",
    "year": "2004",
    "plot": "An Eastern European tourist unexpectedly finds himself stranded at JFK airport and must take up temporary residence there.",
    "imdb": "7.4"
  },
  "Zombie Beavers": {
    "title": "Zombie Beavers",
    "genre": "Unknown"
  },
  "Ford v Ferrari": {
    "title": "Ford v Ferrari",
    "genre": "Action, Biography, Drama",
    "year": "2019",
    "plot": "American car designer Carroll Shelby and driver Ken Miles battle corporate interference and the laws of physics to build a revolutionary race car for Ford in order to defeat Ferrari at the 24 Hours of Le Mans in 1966.",
    "imdb": "8.1"
  },
  "Friends": {
    "title": "Friends",
    "genre": "Comedy, Romance",
    "year": "1994–2004",
    "plot": "The personal and professional lives of six friends living in the Manhattan borough of New York City.",
    "imdb": "8.9"
  },
  "Gods": {
    "title": "Gods",
    "genre": "Action, Adventure, Drama",
    "year": "2014",
    "plot": "The defiant leader Moses rises up against Egyptian Pharaoh Ramses II, setting six hundred thousand slaves on a monumental journey of escape from Egypt and its terrifying cycle of deadly plagues.",
    "imdb": "6.0"
  },
  "No Country for Old Men": {
    "title": "No Country for Old Men",
    "genre": "Crime, Drama, Thriller",
    "year": "2007",
    "plot": "Violence and mayhem ensue after a hunter stumbles upon the aftermath of a drug deal gone wrong and over two million dollars in cash near the Rio Grande.",
    "imdb": "8.2"
  },
  "Mustang": {
    "title": "Mustang",
    "genre": "Drama",
    "year": "2015",
    "plot": "When five orphan girls are seen innocently playing with boys on a beach, their scandalized conservative guardians confine them while forced marriages are arranged.",
    "imdb": "7.6"
  },
  "Blade Runner": {
    "title": "Blade Runner",
    "genre": "Action, Drama, Sci-Fi",
    "year": "1982",
    "plot": "A blade runner must pursue and terminate four replicants who stole a ship in space and have returned to Earth to find their creator.",
    "imdb": "8.1"
  },
  "The Expanse": {
    "title": "The Expanse",
    "genre": "Drama, Mystery, Sci-Fi",
    "year": "2015–2022",
    "plot": "The disappearance of rich-girl-turned-political-activist links the lives of Ceres detective, accidental ship captain and U.N. politician. Amidst political tension between Earth, Mars and the Belt, they unravel the greatest conspir...",
    "imdb": "8.5"
  },
  "The Sting": {
    "title": "The Sting",
    "genre": "Comedy, Crime, Drama",
    "year": "1973",
    "plot": "Two grifters team up to pull off the ultimate con.",
    "imdb": "8.2"
  },
  "Peaky Blinders": {
    "title": "Peaky Blinders",
    "genre": "Crime, Drama",
    "year": "2013–2022",
    "plot": "A gangster family epic set in 1900s England, centering on a gang who sew razor blades in the peaks of their caps, and their fierce boss Tommy Shelby.",
    "imdb": "8.7"
  },
  "South Park": {
    "title": "South Park",
    "genre": "Animation, Comedy",
    "year": "1997–",
    "plot": "The misadventures of four foul-mouthed, dirty-minded, irreverent grade-schoolers who live in the quiet, dysfunctional mountain town of South Park, Colorado.",
    "imdb": "8.7"
  },
  "The Fanatic": {
    "title": "The Fanatic",
    "genre": "Crime, Drama, Mystery",
    "year": "2019",
    "plot": "A rabid film fan stalks his favorite action hero and destroys his life.",
    "imdb": "4.1"
  },
  "Vinci 2": {
    "title": "Vinci 2",
    "genre": "Comedy, Crime",
    "year": "2025",
    "plot": "Twenty years later. Cuma - an ex-art thief - spends his retirement on the Andalusian coast of Spain with his Spanish wife - Carmen. An old friend, Chudy, a former co-worker of Gruby, visits him and proposes another heist in Poland...",
    "imdb": "N/A"
  },
  "Breaking Bad": {
    "title": "Breaking Bad",
    "genre": "Crime, Drama, Thriller",
    "year": "2008–2013",
    "plot": "A chemistry teacher diagnosed with inoperable lung cancer turns to manufacturing and selling methamphetamine with a former student to secure his family's future.",
    "imdb": "9.5"
  },
  "Letters to Santa": {
    "title": "Letters to Santa",
    "genre": "Comedy, Romance",
    "year": "2011",
    "plot": "A romantic comedy set on Christmas Eve in Warsaw and centered around a series of characters.",
    "imdb": "7.2"
  },
  "Narcos": {
    "title": "Narcos",
    "genre": "Biography, Crime, Drama",
    "year": "2015–2017",
    "plot": "A chronicled look at the criminal exploits of Colombian drug lord Pablo Escobar, as well as the many other drug kingpins who plagued the country through the years.",
    "imdb": "8.7"
  },
  "Botoks": {
    "title": "Botoks",
    "genre": "Action, Drama, Thriller",
    "year": "2017",
    "plot": "\"Botoks\" is intended to be a record of the authentic history of strong, determined, and expressive physicians who struggle with life's decisions and problems: discrimination, maternity pressures, the pursuit of youth, the fight fo...",
    "imdb": "3.8"
  },
  "American Made": {
    "title": "American Made",
    "genre": "Action, Comedy, Crime",
    "year": "2017",
    "plot": "The story of Barry Seal, an American pilot who became a drug-runner for the CIA in the 1980s in a clandestine operation that would be exposed as the Iran-Contra Affair.",
    "imdb": "7.1"
  },
  "Saving Private Ryan": {
    "title": "Saving Private Ryan",
    "genre": "Drama, War",
    "year": "1998",
    "plot": "Following the Normandy Landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose comrades have been killed in action.",
    "imdb": "8.6"
  },
  "Whiplash": {
    "title": "Whiplash",
    "genre": "Drama, Music",
    "year": "2014",
    "plot": "A promising young drummer enrolls at a cut-throat music conservatory where his dreams of greatness are mentored by an instructor who will stop at nothing to realize a student's potential.",
    "imdb": "8.5"
  },
  "Ex Machina": {
    "title": "Ex Machina",
    "genre": "Drama, Sci-Fi, Thriller",
    "year": "2014",
    "plot": "A young programmer is selected to participate in a ground-breaking experiment in synthetic intelligence by evaluating the human qualities of a highly advanced humanoid A.I.",
    "imdb": "7.7"
  },
  "Wujek Foliarz": {
    "title": "Wujek Foliarz",
    "genre": "Comedy",
    "year": "2025",
    "plot": "N/A",
    "imdb": "N/A"
  },
  "Gran Torino": {
    "title": "Gran Torino",
    "genre": "Drama",
    "year": "2008",
    "plot": "After a Hmong teenager tries to steal his prized 1972 Gran Torino, a disgruntled, prejudiced Korean War veteran seeks to redeem both the boy and himself.",
    "imdb": "8.1"
  },
  "Iron Man 2": {
    "title": "Iron Man 2",
    "genre": "Action, Sci-Fi",
    "year": "2010",
    "plot": "With the world now aware of his identity as Iron Man, Tony Stark must contend with both his declining health and a vengeful mad man with ties to his father's legacy.",
    "imdb": "6.9"
  },
  "Star Wars": {
    "title": "Star Wars",
    "genre": "Action, Adventure, Fantasy",
    "year": "1977",
    "plot": "Luke Skywalker joins forces with a Jedi Knight, a cocky pilot, a Wookiee and two droids to save the galaxy from the Empire's world-destroying battle station, while also attempting to rescue Princess Leia from the mysterious Darth ...",
    "imdb": "8.6"
  },
  "Boys Don't Cry (Polish)": {
    "title": "Boys Don't Cry (Polish)",
    "genre": "Unknown"
  },
  "Letters to Santa 2": {
    "title": "Letters to Santa 2",
    "genre": "Comedy, Drama, Romance",
    "year": "2015",
    "plot": "Various families experience the ups and downs of their relationships during the Christmas season.",
    "imdb": "5.5"
  },
  "Kung Fury: Fists of Time": {
    "title": "Kung Fury: Fists of Time",
    "genre": "Unknown"
  },
  "The Green Mile": {
    "title": "The Green Mile",
    "genre": "Crime, Drama, Fantasy",
    "year": "1999",
    "plot": "A death row guard learns that a gentle giant in his charge possesses a mysterious gift.",
    "imdb": "8.6"
  },
  "Cale Szczescie": {
    "title": "Cale Szczescie",
    "genre": "Unknown"
  },
  "Sully": {
    "title": "Sully",
    "genre": "Biography, Drama",
    "year": "2016",
    "plot": "When pilot Chesley \"Sully\" Sullenberger lands his damaged plane on the Hudson River in order to save the flight's passengers and crew, some consider him a hero while others think he was reckless.",
    "imdb": "7.4"
  },
  "Makrokosmos": {
    "title": "Makrokosmos",
    "genre": "Unknown"
  },
  "Putin": {
    "title": "Putin",
    "genre": "Biography, Crime, Drama",
    "year": "2025",
    "plot": "A portrait of a formidable political figure, unraveling the contrasting facets of an iron-fisted tyrant and a man haunted by fear.",
    "imdb": "3.1"
  },
  "The Butler": {
    "title": "The Butler",
    "genre": "Biography, Drama",
    "year": "2013",
    "plot": "As Cecil Gaines serves eight presidents during his tenure as a butler at the White House, the civil rights movement, Vietnam, and other major events affect this man's life, family, and American society.",
    "imdb": "7.2"
  },
  "Bridget Jones's Diary": {
    "title": "Bridget Jones's Diary",
    "genre": "Comedy, Drama, Romance",
    "year": "2001",
    "plot": "Bridget Jones is determined to improve herself while she looks for love in a year in which she keeps a personal diary.",
    "imdb": "6.8"
  },
  "Red Poppies": {
    "title": "Red Poppies",
    "genre": "Drama, History, War",
    "year": "2024",
    "plot": "Monte Cassino film follows Jedrek, a Russian ex-gulag orphan joining Allied II Corps. His meeting Pola, a nurse, transforms him as they experience the Battle of Monte Cassino, crucial for the Italian campaign and Jedrek's destiny.",
    "imdb": "4.7"
  },
  "Furia / Furiosa": {
    "title": "Furia / Furiosa",
    "genre": "Unknown"
  },
  "Wladca Pierscieni: Dwie Wieze": {
    "title": "Wladca Pierscieni: Dwie Wieze",
    "genre": "Unknown"
  },
  "Game of Thrones": {
    "title": "Game of Thrones",
    "genre": "Action, Adventure, Drama",
    "year": "2011–2019",
    "plot": "Nine noble families fight for control over the lands of Westeros, while an ancient enemy returns after being dormant for millennia.",
    "imdb": "9.2"
  },
  "A Star Is Born": {
    "title": "A Star Is Born",
    "genre": "Drama, Music, Romance",
    "year": "2018",
    "plot": "A hard-drinking country music star falls in love with a singer whose career quickly takes off.",
    "imdb": "7.6"
  },
  "The Human Centipede (First Sequence)": {
    "title": "The Human Centipede (First Sequence)",
    "genre": "Horror",
    "year": "2009",
    "plot": "A mad scientist kidnaps and mutilates a trio of tourists in order to reassemble them into a human centipede, created by stitching their mouths to each others' rectums.",
    "imdb": "4.4"
  },
  "Kill Bill: Vol. 1": {
    "title": "Kill Bill: Vol. 1",
    "genre": "Action, Crime, Thriller",
    "year": "2003",
    "plot": "After waking from a four-year coma, a former assassin wreaks vengeance on the team of assassins who betrayed her.",
    "imdb": "8.2"
  },
  "Oppenheimer": {
    "title": "Oppenheimer",
    "genre": "Biography, Drama, History",
    "year": "2023",
    "plot": "A dramatization of the life story of J. Robert Oppenheimer, the physicist who had a large hand in the development of the atomic bombs that brought an end to World War II.",
    "imdb": "8.3"
  },
  "Legalna Blondynka": {
    "title": "Legalna Blondynka",
    "genre": "Unknown"
  },
  "The Terminator": {
    "title": "The Terminator",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "1984",
    "plot": "A cyborg assassin from the future attempts to find and kill a young woman who is destined to give birth to a warrior that will lead a resistance to save humankind from extinction.",
    "imdb": "8.1"
  },
  "The Big Bang Theory": {
    "title": "The Big Bang Theory",
    "genre": "Comedy, Romance",
    "year": "2007–2019",
    "plot": "Aspiring film actress Penny moves into a Pasadena apartment across the hall from brilliant, but socially awkward, physicists Sheldon Cooper and Leonard Hofstadter and shows them how little they know about life outside of the lab.",
    "imdb": "8.1"
  },
  "Alien: The 8th Passenger": {
    "title": "Alien: The 8th Passenger",
    "genre": "Unknown"
  },
  "The Devil Wears Prada": {
    "title": "The Devil Wears Prada",
    "genre": "Comedy, Drama",
    "year": "2006",
    "plot": "With an aspiration to become a journalist, Andy, a smart but sensible young graduate, travels to New York. She starts working as an assistant to one of the city's biggest high fashion magazine editors, the cynical Miranda Priestly.",
    "imdb": "7.0"
  },
  "Cars": {
    "title": "Cars",
    "genre": "Animation, Adventure, Comedy",
    "year": "2006",
    "plot": "On the way to the biggest race of his life, a hotshot rookie race car gets stranded in a rundown town and learns that winning isn't everything in life.",
    "imdb": "7.3"
  },
  "Apocalypto": {
    "title": "Apocalypto",
    "genre": "Action, Adventure, Drama",
    "year": "2006",
    "plot": "As the Mayan kingdom faces its decline, a young man is taken on a perilous journey to a world ruled by fear and oppression.",
    "imdb": "7.8"
  },
  "1670": {
    "title": "1670",
    "genre": "Comedy, History",
    "year": "2023–",
    "plot": "In this satirical comedy, a zany nobleman navigates through family feuds and clashes with peasants in his quest to become Poland's most famous figure.",
    "imdb": "7.9"
  },
  "Captain America: Civil War": {
    "title": "Captain America: Civil War",
    "genre": "Action, Sci-Fi",
    "year": "2016",
    "plot": "Political involvement in the Avengers' affairs causes a rift between Captain America and Iron Man.",
    "imdb": "7.8"
  },
  "Forrest Gump": {
    "title": "Forrest Gump",
    "genre": "Drama, Romance",
    "year": "1994",
    "plot": "The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.",
    "imdb": "8.8"
  },
  "Uprowadzona 2": {
    "title": "Uprowadzona 2",
    "genre": "Unknown"
  },
  "The Hidden Face": {
    "title": "The Hidden Face",
    "genre": "Drama, Mystery, Thriller",
    "year": "2011",
    "plot": "Shattered by the unexpected news of their irreversible break-up, an aspiring orchestra conductor is puzzled by his girlfriend's mysterious and seemingly inexplicable case of disappearance. But can he look beyond the facts?",
    "imdb": "7.3"
  },
  "Requiem for a Dream": {
    "title": "Requiem for a Dream",
    "genre": "Drama",
    "year": "2000",
    "plot": "The drug-induced utopias of four Coney Island people are shattered when their addictions run deep.",
    "imdb": "8.3"
  },
  "Enemy at the Gates": {
    "title": "Enemy at the Gates",
    "genre": "Action, Drama, War",
    "year": "2001",
    "plot": "A Russian and a German sniper play a game of cat-and-mouse during the Battle of Stalingrad.",
    "imdb": "7.5"
  },
  "Talk to Me": {
    "title": "Talk to Me",
    "genre": "Horror, Thriller",
    "year": "2022",
    "plot": "When a group of friends discover how to conjure spirits using an embalmed hand, they become hooked on the new thrill, until one of them goes too far and unleashes terrifying supernatural forces.",
    "imdb": "7.1"
  },
  "Panna W Tarapatach": {
    "title": "Panna W Tarapatach",
    "genre": "Unknown"
  },
  "Léon: The Professional": {
    "title": "Léon: The Professional",
    "genre": "Action, Crime, Drama",
    "year": "1994",
    "plot": "An Italian hit man protects a New York orphan.",
    "imdb": "8.5"
  },
  "Midsommar": {
    "title": "Midsommar",
    "genre": "Drama, Horror, Mystery",
    "year": "2019",
    "plot": "A couple travels to Northern Europe to visit a rural hometown's fabled Swedish mid-summer festival. What begins as an idyllic retreat quickly devolves into an increasingly violent and bizarre competition at the hands of a pagan cult.",
    "imdb": "7.1"
  },
  "Skyfall": {
    "title": "Skyfall",
    "genre": "Action, Adventure, Thriller",
    "year": "2012",
    "plot": "James Bond's loyalty to M is tested when her past comes back to haunt her. When MI6 comes under attack, 007 must track down and destroy the threat, no matter how personal the cost.",
    "imdb": "7.8"
  },
  "To Wlasnie Milosc": {
    "title": "To Wlasnie Milosc",
    "genre": "Unknown"
  },
  "Mad Max": {
    "title": "Mad Max",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "1979",
    "plot": "In a self-destructing world, a vengeful Australian policeman sets out to stop a violent motorcycle gang.",
    "imdb": "6.8"
  },
  "Dog Hill": {
    "title": "Dog Hill",
    "genre": "Documentary, Short, Biography",
    "year": "2011",
    "plot": "A story about three men of different age who spend six months each year working as shepherds, away from their families and civilization. They have a lot of time to talk about the most important and leaving aspects of life.",
    "imdb": "5.3"
  },
  "Gone in 60 Seconds": {
    "title": "Gone in 60 Seconds",
    "genre": "Action, Crime, Thriller",
    "year": "2000",
    "plot": "To save his brother, ex-thief Memphis must steal 50 luxury cars in 3 days for a crime boss. He reunites his old crew, including his mentor Otto and ex-girlfriend Sway, while police track them.",
    "imdb": "6.5"
  },
  "A Beautiful Mind": {
    "title": "A Beautiful Mind",
    "genre": "Biography, Drama, Mystery",
    "year": "2001",
    "plot": "A mathematical genius, John Nash made an astonishing discovery early in his career and stood on the brink of international acclaim. But the handsome and arrogant Nash soon found himself on a harrowing journey of self-discovery.",
    "imdb": "8.2"
  },
  "Life of Pi": {
    "title": "Life of Pi",
    "genre": "Adventure, Drama, Fantasy",
    "year": "2012",
    "plot": "A young man who survives a disaster at sea is hurtled into an epic journey of adventure and discovery. While cast away, he forms an unexpected connection with another survivor: a fearsome Bengal tiger.",
    "imdb": "7.9"
  },
  "Sanjuro": {
    "title": "Sanjuro",
    "genre": "Action, Drama, Thriller",
    "year": "1962",
    "plot": "A crafty samurai helps a young man and his fellow clansmen trying to save his uncle, who has been framed and imprisoned by a corrupt superintendent.",
    "imdb": "8.0"
  },
  "Silent Night": {
    "title": "Silent Night",
    "genre": "Action, Crime, Drama",
    "year": "2023",
    "plot": "A grieving father enacts his long-awaited revenge against a ruthless gang on Christmas Eve.",
    "imdb": "5.3"
  },
  "The Grand Budapest Hotel": {
    "title": "The Grand Budapest Hotel",
    "genre": "Comedy, Drama",
    "year": "2014",
    "plot": "A writer encounters the owner of an aging high-class hotel, who tells him of his early years serving as a lobby boy in the hotel's glorious years under an exceptional concierge.",
    "imdb": "8.1"
  },
  "Our Folks": {
    "title": "Our Folks",
    "genre": "Comedy",
    "year": "1967",
    "plot": "Two quarreling peasant families, who were forced to leave their lands after the war, are settled by accident on two neighbouring farms.",
    "imdb": "7.9"
  },
  "The Office": {
    "title": "The Office",
    "genre": "Comedy",
    "year": "2005–2013",
    "plot": "A mockumentary on a group of typical office workers, where the workday consists of ego clashes, inappropriate behavior, tedium and romance.",
    "imdb": "9.0"
  },
  "Marked": {
    "title": "Marked",
    "genre": "Thriller",
    "year": "2007",
    "plot": "A group of Ghost Hunters discover a powerful force that puts one of their members in great danger.",
    "imdb": "3.3"
  },
  "Jurassic Park": {
    "title": "Jurassic Park",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "1993",
    "plot": "An industrialist invites some experts to visit his theme park of cloned dinosaurs. After a power failure, the creatures run loose, putting everyone's lives, including his grandchildren's, in danger.",
    "imdb": "8.2"
  },
  "Quo Vadis": {
    "title": "Quo Vadis",
    "genre": "Drama, Romance",
    "year": "1951",
    "plot": "After fierce Roman commander Marcus Vinicius becomes infatuated with beautiful Christian hostage Lygia, he begins to question the tyrannical leadership of the despotic emperor Nero.",
    "imdb": "7.1"
  },
  "Masz Wiadomosc": {
    "title": "Masz Wiadomosc",
    "genre": "Unknown"
  },
  "Kill Bill: Vol. 1 / Vol. 2": {
    "title": "Kill Bill: Vol. 1 / Vol. 2",
    "genre": "Unknown"
  },
  "Iron Man 3": {
    "title": "Iron Man 3",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2013",
    "plot": "When Tony Stark's world is torn apart by a formidable terrorist called the Mandarin, he starts an odyssey of rebuilding and retribution.",
    "imdb": "7.1"
  },
  "Terminator 2: Judgment Day": {
    "title": "Terminator 2: Judgment Day",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "1991",
    "plot": "A cyborg, identical to the one who failed to kill Sarah Connor, must now protect her ten year old son John from an even more advanced and powerful cyborg.",
    "imdb": "8.6"
  },
  "Planeta Singli": {
    "title": "Planeta Singli",
    "genre": "Comedy, Romance",
    "year": "2018",
    "plot": "The relationship between Anna (Agnieszka Wiedtocha) and Tomej (Maciej Stuhr) is experiencing a considerable crisis. He, the showman-BN'er, does not intend to settle down at all. On the other hand, she wants that very much.",
    "imdb": "5.6"
  },
  "How I Became a Gangster: A True Story": {
    "title": "How I Became a Gangster: A True Story",
    "genre": "Unknown"
  },
  "F9: The Fast Saga": {
    "title": "F9: The Fast Saga",
    "genre": "Action, Crime, Thriller",
    "year": "2021",
    "plot": "Dom and the crew must take on an international terrorist who turns out to be Dom and Mia's estranged brother.",
    "imdb": "5.2"
  },
  "Blue Eye Samurai": {
    "title": "Blue Eye Samurai",
    "genre": "Animation, Action, Adventure",
    "year": "2023–",
    "plot": "Driven by a dream of revenge against those who made her an outcast in Edo-period Japan, a young warrior cuts a bloody path toward her destiny.",
    "imdb": "8.7"
  },
  "Tusk": {
    "title": "Tusk",
    "genre": "Comedy, Horror",
    "year": "2014",
    "plot": "A brash and arrogant podcaster gets more than he bargained for when he travels to Canada to interview a mysterious recluse... who has a rather disturbing fondness for walruses.",
    "imdb": "5.4"
  },
  "The Matrix": {
    "title": "The Matrix",
    "genre": "Action, Sci-Fi",
    "year": "1999",
    "plot": "When a beautiful stranger leads computer hacker Neo to a forbidding underworld, he discovers the shocking truth--the life he knows is the elaborate deception of an evil cyber-intelligence.",
    "imdb": "8.7"
  },
  "Django Unchained": {
    "title": "Django Unchained",
    "genre": "Drama, Western",
    "year": "2012",
    "plot": "With the help of a German bounty-hunter, a freed slave sets out to rescue his wife from a brutal plantation owner in Mississippi.",
    "imdb": "8.5"
  },
  "Birdemic": {
    "title": "Birdemic",
    "genre": "Horror, Thriller",
    "year": "2010",
    "plot": "A horde of mutated birds descends upon the quiet town of Half Moon Bay, California. As the death toll rises, two citizens manage to fight back, but will they survive Birdemic?",
    "imdb": "1.7"
  },
  "Smarzone Zielone Pomidory": {
    "title": "Smarzone Zielone Pomidory",
    "genre": "Unknown"
  },
  "Avatar": {
    "title": "Avatar",
    "genre": "Action, Adventure, Fantasy",
    "year": "2009",
    "plot": "A paraplegic Marine dispatched to the moon Pandora on a unique mission becomes torn between following his orders and protecting the world he feels is his home.",
    "imdb": "7.9"
  },
  "Mr. Kleks in Space": {
    "title": "Mr. Kleks in Space",
    "genre": "Unknown"
  },
  "Fullmetal Alchemist: Brotherhood": {
    "title": "Fullmetal Alchemist: Brotherhood",
    "genre": "Animation, Action, Adventure",
    "year": "2009–2010",
    "plot": "Two brothers search for a Philosopher's Stone after an attempt to revive their deceased mother goes awry and leaves them in damaged physical forms.",
    "imdb": "9.1"
  },
  "Schindler's List": {
    "title": "Schindler's List",
    "genre": "Biography, Drama, History",
    "year": "1993",
    "plot": "In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.",
    "imdb": "9.0"
  },
  "A Clockwork Orange": {
    "title": "A Clockwork Orange",
    "genre": "Crime, Sci-Fi",
    "year": "1971",
    "plot": "Alex DeLarge and his droogs barbarize a decaying near-future.",
    "imdb": "8.2"
  },
  "[REC]": {
    "title": "[REC]",
    "genre": "Horror, Mystery, Thriller",
    "year": "2007",
    "plot": "A television reporter and cameraman follow emergency workers into a dark apartment building and are quickly locked inside with something terrifying.",
    "imdb": "7.4"
  },
  "The Perfect Couple": {
    "title": "The Perfect Couple",
    "genre": "Crime, Drama, Mystery",
    "year": "2024–",
    "plot": "When one lavish wedding ends in disaster before it can even begin--with a body discovered in Nantucket Harbor just hours before the ceremony--everyone in the wedding party is suddenly a suspect.",
    "imdb": "6.5"
  },
  "Miś": {
    "title": "Miś",
    "genre": "Short, Comedy",
    "year": "2001",
    "plot": "N/A",
    "imdb": "6.4"
  },
  "Battleship": {
    "title": "Battleship",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2012",
    "plot": "A fleet of ships is forced to do battle with an armada of unknown origins in order to discover and thwart their destructive goals.",
    "imdb": "5.8"
  },
  "Planet Single": {
    "title": "Planet Single",
    "genre": "Comedy, Romance",
    "year": "2016",
    "plot": "A celebrity TV host helps a shy music teacher navigate dating while she shows him real life. His show becomes successful. When they start falling for each other, she finds her perfect match online.",
    "imdb": "6.8"
  },
  "Shrek": {
    "title": "Shrek",
    "genre": "Animation, Adventure, Comedy",
    "year": "2001",
    "plot": "A mean lord exiles fairytale creatures to the swamp of a grumpy ogre, who must go on a quest and rescue a princess for the lord in order to get his land back.",
    "imdb": "7.9"
  },
  "Taken": {
    "title": "Taken",
    "genre": "Action, Crime, Thriller",
    "year": "2008",
    "plot": "A retired CIA agent travels across Europe and relies on his old skills to save his estranged daughter, who has been kidnapped while on a trip to Paris.",
    "imdb": "7.7"
  },
  "Interstellar": {
    "title": "Interstellar",
    "genre": "Adventure, Drama, Sci-Fi",
    "year": "2014",
    "plot": "When Earth becomes uninhabitable in the future, a farmer and ex-NASA pilot, Joseph Cooper, is tasked to pilot a spacecraft, along with a team of researchers, to find a new planet for humans.",
    "imdb": "8.7"
  },
  "The Lion King": {
    "title": "The Lion King",
    "genre": "Animation, Adventure, Drama",
    "year": "1994",
    "plot": "Lion prince Simba and his father are targeted by his bitter uncle, who wants to ascend the throne himself.",
    "imdb": "8.5"
  },
  "Cyberpunk: Edgerunners": {
    "title": "Cyberpunk: Edgerunners",
    "genre": "Animation, Action, Adventure",
    "year": "2022–",
    "plot": "A Street Kid trying to survive in a technology and body modification-obsessed city of the future. Having everything to lose, he chooses to stay alive by becoming an Edgerunner, a Mercenary outlaw also known as a Cyberpunk.",
    "imdb": "8.3"
  },
  "The Shawshank Redemption": {
    "title": "The Shawshank Redemption",
    "genre": "Drama",
    "year": "1994",
    "plot": "A banker convicted of uxoricide forms a friendship over a quarter century with a hardened convict, while maintaining his innocence and trying to remain hopeful through simple compassion.",
    "imdb": "9.3"
  },
  "Family Guy": {
    "title": "Family Guy",
    "genre": "Animation, Comedy",
    "year": "1999–",
    "plot": "In a wacky Rhode Island town, a dysfunctional family strives to cope with everyday life as they are thrown from one crazy scenario to another.",
    "imdb": "8.1"
  },
  "Furia": {
    "title": "Furia",
    "genre": "Crime, Drama, Thriller",
    "year": "2021–",
    "plot": "Asgeir and Ragna get entangled in a web of radical right-wing groups and followers - sending them on a journey from the fjords of Norway to a Berlin preparing for Germany's election.",
    "imdb": "7.1"
  },
  "The Pianist": {
    "title": "The Pianist",
    "genre": "Biography, Drama, Music",
    "year": "2002",
    "plot": "During WWII, acclaimed Polish musician Wladyslaw faces various struggles as he loses contact with his family. As the situation worsens, he hides in the ruins of Warsaw in order to survive.",
    "imdb": "8.5"
  },
  "The Godfather": {
    "title": "The Godfather",
    "genre": "Crime, Drama",
    "year": "1972",
    "plot": "The aging patriarch of an organized crime dynasty transfers control of his clandestine empire to his reluctant son.",
    "imdb": "9.2"
  },
  "Cast Away": {
    "title": "Cast Away",
    "genre": "Adventure, Drama, Romance",
    "year": "2000",
    "plot": "A FedEx executive undergoes a physical and emotional transformation after crash landing on a deserted island.",
    "imdb": "7.8"
  },
  "Auto 2": {
    "title": "Auto 2",
    "genre": "Short, Action, Crime, Thriller",
    "year": "1999",
    "plot": "N/A",
    "imdb": "7.9"
  },
  "With Fire and Sword": {
    "title": "With Fire and Sword",
    "genre": "Adventure, Drama, History",
    "year": "1999",
    "plot": "An epic story about the Ukrainian uprising against the Polish-Lithuanian Commonwealth magnates in the 17th Century.",
    "imdb": "7.0"
  },
  "Iron Man": {
    "title": "Iron Man",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2008",
    "plot": "After being held captive in an Afghan cave, billionaire engineer Tony Stark creates a unique weaponized suit of armor to fight evil.",
    "imdb": "7.9"
  },
  "Hacksaw Ridge": {
    "title": "Hacksaw Ridge",
    "genre": "Biography, Drama, History",
    "year": "2016",
    "plot": "World War II American Army Medic Desmond T. Doss, serving during the Battle of Okinawa, refuses to kill people and becomes the first man in American history to receive the Medal of Honor without firing a shot.",
    "imdb": "8.1"
  },
  "Budda, Dzieciak '98": {
    "title": "Budda, Dzieciak '98",
    "genre": "Unknown"
  },
  "Rambo": {
    "title": "Rambo",
    "genre": "Action, Thriller",
    "year": "2008",
    "plot": "In Thailand, John Rambo joins a group of mercenaries to venture into war-torn Burma, and rescue a group of Christian aid workers who were kidnapped by the ruthless local infantry unit.",
    "imdb": "7.0"
  },
  "The X-Files": {
    "title": "The X-Files",
    "genre": "Adventure, Crime, Drama",
    "year": "1993–2018",
    "plot": "Two F.B.I. Agents, Fox Mulder the believer and Dana Scully the skeptic, investigate the strange and unexplained, while hidden forces work to impede their efforts.",
    "imdb": "8.6"
  },
  "Moj Chlopak Sie Zeni": {
    "title": "Moj Chlopak Sie Zeni",
    "genre": "Unknown"
  },
  "Narzeczony Na Niby": {
    "title": "Narzeczony Na Niby",
    "genre": "Comedy, Romance",
    "year": "2018",
    "plot": "Can a white lie get out of control and lead to a total disaster? Or maybe just as everything falls apart in life, it's possible to put it back into place again? Karina is doing her best to have the first happy relationship ever. U...",
    "imdb": "5.1"
  },
  "Milosc Do Kwadratu": {
    "title": "Milosc Do Kwadratu",
    "genre": "Unknown"
  },
  "Oczy Julii": {
    "title": "Oczy Julii",
    "genre": "Unknown"
  },
  "Auta 3": {
    "title": "Auta 3",
    "genre": "Unknown"
  },
  "The Boy in the Striped Pyjamas": {
    "title": "The Boy in the Striped Pyjamas",
    "genre": "Unknown"
  },
  "Barbarians": {
    "title": "Barbarians",
    "genre": "Action, Adventure, Drama",
    "year": "2020–2022",
    "plot": "Torn between the mighty empire that raised him and his own tribal people, a Roman officer's conflicted allegiances lead to an epic historical clash.",
    "imdb": "7.2"
  },
  "Taxi": {
    "title": "Taxi",
    "genre": "Action, Comedy, Crime",
    "year": "1998",
    "plot": "To work off his tarnished driving record, a hip taxi driver must chauffeur a loser police inspector on the trail of German bank robbers.",
    "imdb": "7.0"
  },
  "Team Building Trip": {
    "title": "Team Building Trip",
    "genre": "Unknown"
  },
  "The End of Evangelion": {
    "title": "The End of Evangelion",
    "genre": "Animation, Action, Drama",
    "year": "1997",
    "plot": "Concurrent theatrical ending of the TV series Neon Genesis Evangelion (1995).",
    "imdb": "8.1"
  },
  "The Hobbit": {
    "title": "The Hobbit",
    "genre": "Animation, Adventure, Family",
    "year": "1977",
    "plot": "A homebody hobbit in Middle Earth gets talked into joining a quest with a group of dwarves to recover their treasure from a dragon.",
    "imdb": "6.7"
  },
  "Klaus": {
    "title": "Klaus",
    "genre": "Animation, Adventure, Comedy",
    "year": "2019",
    "plot": "A simple act of kindness always sparks another, even in a frozen, faraway place. When Smeerensburg's new postman, Jesper, befriends toymaker Klaus, their gifts melt an age-old feud and deliver a sleigh full of holiday traditions.",
    "imdb": "8.2"
  },
  "Colonel Wolodyjowski": {
    "title": "Colonel Wolodyjowski",
    "genre": "Adventure, Drama, History",
    "year": "1969",
    "plot": "In 1668 Polish colonel Michael Wolodyjowski, who recently retired to a monastery, is recalled to active duty and takes charge of Poland's eastern frontier defenses against invading Tatar hordes and Ottoman armies.",
    "imdb": "7.2"
  },
  "How Far the Legs Will Carry": {
    "title": "How Far the Legs Will Carry",
    "genre": "Unknown"
  },
  "How to Sell Drugs Online (Fast)": {
    "title": "How to Sell Drugs Online (Fast)",
    "genre": "Comedy, Crime, Drama",
    "year": "2019–2025",
    "plot": "To win back the love of his life, a high school student and his best friend launch Europe's largest online drug business from their teenage bedroom.",
    "imdb": "7.8"
  },
  "Mr. Kleks' Academy": {
    "title": "Mr. Kleks' Academy",
    "genre": "Unknown"
  },
  "The Deluge": {
    "title": "The Deluge",
    "genre": "Adventure, History, Romance",
    "year": "1974",
    "plot": "During the 1655 war between Protestant Sweden and Catholic Polish-Lithuanian Commonwealth some Polish-Lithuanian nobles side with Swedish king Charles X Gustav while others side with the Polish king Jan Kazimierz.",
    "imdb": "7.7"
  },
  "Scooby-Doo": {
    "title": "Scooby-Doo",
    "genre": "Adventure, Comedy, Family",
    "year": "2002",
    "plot": "After an acrimonious break up, the Mystery Inc. gang are individually brought to an island resort to investigate strange goings on.",
    "imdb": "5.3"
  },
  "Alpha Males": {
    "title": "Alpha Males",
    "genre": "Comedy",
    "year": "2022–",
    "plot": "Pedro, Luis, Raúl and Santi are four friends who feel a bit lost in the new world of empowered women, each trying to adjust in their own haphazard way.",
    "imdb": "7.6"
  },
  "How I Started World War II": {
    "title": "How I Started World War II",
    "genre": "Unknown"
  },
  "Captain Bomb": {
    "title": "Captain Bomb",
    "genre": "Unknown"
  },
  "Death Race": {
    "title": "Death Race",
    "genre": "Action, Sci-Fi, Thriller",
    "year": "2008",
    "plot": "Ex-con Jensen Ames is forced by the warden of a notorious prison to compete in our post-industrial world's most popular sport: a car race in which inmates must brutalize and kill one another on the road to victory.",
    "imdb": "6.4"
  },
  "Jan Heweliusz": {
    "title": "Jan Heweliusz",
    "genre": "Unknown"
  },
  "Nowy Poczatek": {
    "title": "Nowy Poczatek",
    "genre": "N/A",
    "year": "1991",
    "plot": "N/A",
    "imdb": "N/A"
  },
  "1863rd Insurgent": {
    "title": "1863rd Insurgent",
    "genre": "Unknown"
  },
  "Inglourious Basterds": {
    "title": "Inglourious Basterds",
    "genre": "Adventure, Drama, War",
    "year": "2009",
    "plot": "In Nazi-occupied France during World War II, a plan to assassinate Nazi leaders by a group of Jewish U.S. soldiers coincides with a theatre owner's vengeful plans for the same.",
    "imdb": "8.4"
  },
  "The Hunt for Red October": {
    "title": "The Hunt for Red October",
    "genre": "Action, Adventure, Thriller",
    "year": "1990",
    "plot": "Moscow, Washington D.C. and a CIA Analyst track a rogue Soviet Captain and his new submarine.",
    "imdb": "7.5"
  },
  "Garfield": {
    "title": "Garfield",
    "genre": "Short, Drama",
    "year": "2017",
    "plot": "Krishna wakes up in a strange place, with a strange guy. As she pieces together how she got there, she realises that the reasons may be bigger than just the night before.",
    "imdb": "8.5"
  },
  "The Hunger Games": {
    "title": "The Hunger Games",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2012",
    "plot": "Katniss Everdeen voluntarily takes her younger sister's place in the Hunger Games: a televised competition in which two teenagers from each of the twelve Districts of Panem are chosen at random to fight to the death.",
    "imdb": "7.2"
  },
  "Goodfellas": {
    "title": "Goodfellas",
    "genre": "Biography, Crime, Drama",
    "year": "1990",
    "plot": "The story of Henry Hill and his life in the mafia, covering his relationship with his wife Karen and his mob partners Jimmy Conway and Tommy DeVito.",
    "imdb": "8.7"
  },
  "Lejdis": {
    "title": "Lejdis",
    "genre": "Unknown"
  },
  "Money Heist": {
    "title": "Money Heist",
    "genre": "Action, Crime, Drama",
    "year": "2017–2021",
    "plot": "An unusual group of robbers attempt to carry out the most perfect robbery in Spanish history - stealing 2.4 billion euros from the Royal Mint of Spain.",
    "imdb": "8.2"
  },
  "Akira": {
    "title": "Akira",
    "genre": "Animation, Action, Drama",
    "year": "1988",
    "plot": "A secret military project endangers Neo-Tokyo when it turns a teenage biker gang member into a rampaging psychic psychopath who can only be stopped by his best friend.",
    "imdb": "8.0"
  },
  "Dead Poets Society": {
    "title": "Dead Poets Society",
    "genre": "Comedy, Drama",
    "year": "1989",
    "plot": "Maverick teacher John Keating returns in 1959 to the prestigious New England boys' boarding school where he was once a star student, using poetry to embolden his pupils to new heights of self-expression.",
    "imdb": "8.1"
  },
  "Frozen": {
    "title": "Frozen",
    "genre": "Animation, Adventure, Comedy",
    "year": "2013",
    "plot": "Fearless optimist Anna teams up with rugged mountain man Kristoff and his loyal reindeer Sven in an epic journey to find Anna's sister Elsa, whose icy powers have trapped the kingdom of Arendelle in eternal winter.",
    "imdb": "7.4"
  },
  "Avengers: Age of Ultron": {
    "title": "Avengers: Age of Ultron",
    "genre": "Action, Adventure, Sci-Fi",
    "year": "2015",
    "plot": "When Tony Stark and Bruce Banner try to jump-start a dormant peacekeeping program called Ultron, things go horribly wrong and it's up to Earth's mightiest heroes to stop the villainous Ultron from enacting his terrible plan.",
    "imdb": "7.3"
  },
  "Pilecki Report": {
    "title": "Pilecki Report",
    "genre": "Unknown"
  },
  "The Quack": {
    "title": "The Quack",
    "genre": "Drama, Romance",
    "year": "1982",
    "plot": "Abandoned by his wife and daughter, a famous surgeon starts drinking, hurts his head and loses his memory. His medical knowledge gradually resurfaces and he becomes a village healer, not remembering who he is.",
    "imdb": "7.8"
  },
  "The Wolf of Wall Street": {
    "title": "The Wolf of Wall Street",
    "genre": "Biography, Comedy, Crime",
    "year": "2013",
    "plot": "Based on the true story of Jordan Belfort, from his rise to a wealthy stock-broker living the high life to his fall involving crime, corruption and the federal government.",
    "imdb": "8.2"
  },
  "The Dark Knight": {
    "title": "The Dark Knight",
    "genre": "Action, Crime, Drama",
    "year": "2008",
    "plot": "When a menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman, James Gordon and Harvey Dent must work together to put an end to the madness.",
    "imdb": "9.1"
  },
  "Witch Hunt": {
    "title": "Witch Hunt",
    "genre": "Drama, Fantasy, Horror",
    "year": "2021",
    "plot": "In a modern America where witches are real and witchcraft is illegal, a sheltered teenager must face her own demons and prejudices as she helps two young witches avoid law enforcement and cross the southern border to asylum in Mex...",
    "imdb": "4.9"
  },
  "The Deliquent(?)": {
    "title": "The Deliquent(?)",
    "genre": "Unknown"
  },
  "Narzeczony Mimo Woli": {
    "title": "Narzeczony Mimo Woli",
    "genre": "Unknown"
  },
  "Dzień Swira": {
    "title": "Dzień Swira",
    "genre": "Unknown"
  },
  "Johnny English Reborn": {
    "title": "Johnny English Reborn",
    "genre": "Action, Adventure, Comedy",
    "year": "2011",
    "plot": "Johnny English goes up against international assassins hunting down Chinese Premier Xiang Ping.",
    "imdb": "6.3"
  },
  "[REC] 3": {
    "title": "[REC] 3",
    "genre": "Action, Horror, Thriller",
    "year": "2012",
    "plot": "A couple's wedding day turns horrific as some of the guests start showing signs of a strange illness.",
    "imdb": "5.0"
  },
  "Rocky II": {
    "title": "Rocky II",
    "genre": "Drama, Sport",
    "year": "1979",
    "plot": "Rocky struggles in family life after his bout with Apollo Creed, while the embarrassed champ insistently goads him to accept a challenge for a rematch.",
    "imdb": "7.3"
  },
  "Pulp Fiction": {
    "title": "Pulp Fiction",
    "genre": "Crime, Drama",
    "year": "1994",
    "plot": "The lives of two mob hitmen, a boxer, a gangster and his wife, and a pair of diner bandits intertwine in four tales of violence and redemption.",
    "imdb": "8.8"
  },
  "The Mire": {
    "title": "The Mire",
    "genre": "Crime, Drama, Thriller",
    "year": "2018–2024",
    "plot": "In an early-'80s Polish town, a prostitute and a youth leader are found killed, but the police's handling of the case makes two journalists suspicious.",
    "imdb": "7.1"
  },
  "Braveheart": {
    "title": "Braveheart",
    "genre": "Biography, Drama, War",
    "year": "1995",
    "plot": "Scottish warrior William Wallace leads his countrymen in a rebellion to free his homeland from the tyranny of King Edward I of England.",
    "imdb": "8.3"
  },
  "Fantômas": {
    "title": "Fantômas",
    "genre": "Horror, Thriller, Mystery",
    "year": "1980",
    "plot": "Fantomas, a master criminal, commits murders and heists, seducing a widow and infiltrating high society, ultimately evading execution by switching places with an actor.",
    "imdb": "6.6"
  },
  "Black Hawk Down": {
    "title": "Black Hawk Down",
    "genre": "Action, Drama, History",
    "year": "2001",
    "plot": "The story of one hundred and sixty elite U.S. soldiers who dropped into Mogadishu in October 1993 to capture two top lieutenants of a renegade warlord, but found themselves in a desperate battle with a large force of heavily armed...",
    "imdb": "7.7"
  },
  "Kill bill": {
    "title": "Kill bill",
    "genre": "Short, Horror",
    "year": "2023",
    "plot": "N/A",
    "imdb": "N/A"
  },
  "Walk Ahead, Brother": {
    "title": "Walk Ahead, Brother",
    "genre": "Unknown"
  },
  "Symmetry": {
    "title": "Symmetry",
    "genre": "Adventure, Musical, Sci-Fi",
    "year": "2015",
    "plot": "SYMMETRY is a dance-opera film shot inside CERN, the largest experimental particle physics facility in the world. With the cathedral-like majesty of the Large Hadron Collider as his theatre, a modern physicist searches for the sma...",
    "imdb": "6.9"
  },
  "Law of Vengeance": {
    "title": "Law of Vengeance",
    "genre": "Unknown"
  },
  "Titanic": {
    "title": "Titanic",
    "genre": "Drama, Romance",
    "year": "1997",
    "plot": "A seventeen-year-old aristocrat falls in love with a kind but poor artist aboard the luxurious, ill-fated R.M.S. Titanic.",
    "imdb": "7.9"
  },
  "Fight Club": {
    "title": "Fight Club",
    "genre": "Crime, Drama, Thriller",
    "year": "1999",
    "plot": "An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.",
    "imdb": "8.8"
  },
  "Gran Turismo": {
    "title": "Gran Turismo",
    "genre": "Action, Adventure, Drama",
    "year": "2023",
    "plot": "Based on the unbelievable, inspiring true story of a team of underdogs - a struggling, working-class gamer, a failed former race car driver, and an idealistic motorsport exec - who risk it all to take on the most elite sport in th...",
    "imdb": "7.1"
  },
  "Rubber": {
    "title": "Rubber",
    "genre": "Comedy, Fantasy, Horror",
    "year": "2010",
    "plot": "A homicidal car tire, discovering it has destructive psionic power, sets its sights on a desert town once a mysterious woman becomes its obsession.",
    "imdb": "5.7"
  },
  "Blade Runner 2049": {
    "title": "Blade Runner 2049",
    "genre": "Action, Drama, Mystery",
    "year": "2017",
    "plot": "Young Blade Runner K's discovery of a long-buried secret leads him to track down former Blade Runner Rick Deckard, who's been missing for thirty years.",
    "imdb": "8.0"
  }
}